uFVM/tutorials/multiphase/damBreak/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p 
    { 
        solver          smoothSolver; 
        smoother        ILU; 
        tolerance       1e-05; 
        relTol          0;
    } 

    U 
    { 
        solver          smoothSolver; 
        smoother        ILU; 
        tolerance       1e-05; 
        relTol          0; 
    } 

    alpha.water 
    { 
        solver          smoothSolver; 
        smoother        ILU; 
        tolerance       1e-05; 
        relTol          0;
    }

    alpha.air 
    { 
        solver          smoothSolver; 
        smoother        ILU; 
        tolerance       1e-05; 
        relTol          0;
    }
}

SIMPLE
{
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        1;
    pRefValue       0;
    residualControl
    {
        p               0.0001;
        U               0.0001;
        alpha.water     0.0001;
        alpha.air       0.0001;
    }
}

relaxationFactors 
{ 
    fields 
    { 
        p               0.3; 
    } 
    equations 
    { 
        U               0.7; 
        alpha.water     0.7; 
        alpha.air       0.7; 
    } 
} 


// ************************************************************************* //
